In [1]:
import pandas as pd

In [2]:
df =pd.read_csv('US_Baby_Names_right.csv')

In [3]:
df

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

In [4]:
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [5]:
df.shape

(1016395, 7)

In [6]:
df.info(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

In [7]:
df.tail()

         Unnamed: 0       Id     Name  Year Gender State  Count
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

In [8]:
df.columns

Index(['Unnamed: 0', 'Id', 'Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

In [9]:
df[['Name','Gender']]

            Name Gender
0           Emma      F
1        Madison      F
2         Hannah      F
3          Grace      F
4          Emily      F
...          ...    ...
1016390     Seth      M
1016391  Spencer      M
1016392     Tyce      M
1016393   Victor      M
1016394   Waylon      M

[1016395 rows x 2 columns]

In [10]:
df[0:5]

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [11]:
df.iloc[2:5]

   Unnamed: 0     Id    Name  Year Gender State  Count
2       11351  11352  Hannah  2004      F    AK     46
3       11352  11353   Grace  2004      F    AK     44
4       11353  11354   Emily  2004      F    AK     41

In [12]:
df.loc[df['Name'] == "Emma"]

         Unnamed: 0       Id  Name  Year Gender State  Count
0             11349    11350  Emma  2004      F    AK     62
205           11554    11555  Emma  2005      F    AK     49
418           11767    11768  Emma  2006      F    AK     49
644           11993    11994  Emma  2007      F    AK     41
838           12187    12188  Emma  2008      F    AK     51
...             ...      ...   ...   ...    ...   ...    ...
1013854     5633487  5633488  Emma  2010      F    WY     23
1013983     5633616  5633617  Emma  2011      F    WY     43
1014104     5633737  5633738  Emma  2012      F    WY     40
1014222     5633855  5633856  Emma  2013      F    WY     30
1014362     5633995  5633996  Emma  2014      F    WY     32

[566 rows x 7 columns]

In [13]:
df.describe()

         Unnamed: 0            Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830990e+06  2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  1.652476e+06  3.138293e+00  9.739735e+01
min    1.134900e+04  1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317326e+06  1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811920e+06  2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242554e+06  4.242556e+06  2.012000e+03  2.600000e+01
max    5.647425e+06  5.647426e+06  2.014000e+03  4.167000e+03

In [14]:
df.sort_values('Name',ascending=False)

        Unnamed: 0       Id    Name  Year Gender State  Count
885288     4937323  4937324  Zyriah  2014      F    TX      6
235986     1238450  1238451  Zyriah  2007      F    GA      5
867512     4919547  4919548  Zyriah  2009      F    TX      5
855869     4907904  4907905  Zyriah  2006      F    TX      6
393474     2137371  2137372  Zyriah  2011      F    LA      6
...            ...      ...     ...   ...    ...   ...    ...
120728      691905   691906   Aadan  2008      M    CA      7
123846      695023   695024   Aadan  2009      M    CA      6
897674     5061278  5061279   Aadan  2008      M    TX      5
693699     3865866  3865867   Aaban  2013      M    NY      6
695768     3867935  3867936   Aaban  2014      M    NY      6

[1016395 rows x 7 columns]

In [15]:
df.sort_values('Name',ascending=True)

        Unnamed: 0       Id    Name  Year Gender State  Count
693699     3865866  3865867   Aaban  2013      M    NY      6
695768     3867935  3867936   Aaban  2014      M    NY      6
897674     5061278  5061279   Aadan  2008      M    TX      5
120728      691905   691906   Aadan  2008      M    CA      7
138678      709855   709856   Aadan  2014      M    CA      5
...            ...      ...     ...   ...    ...   ...    ...
885288     4937323  4937324  Zyriah  2014      F    TX      6
867512     4919547  4919548  Zyriah  2009      F    TX      5
881208     4933243  4933244  Zyriah  2013      F    TX      7
855869     4907904  4907905  Zyriah  2006      F    TX      6
244816     1247280  1247281  Zyriah  2012      F    GA      5

[1016395 rows x 7 columns]

In [16]:
df.sort_values(['Name','State'],ascending=[0,0])

        Unnamed: 0       Id    Name  Year Gender State  Count
855869     4907904  4907905  Zyriah  2006      F    TX      6
858842     4910877  4910878  Zyriah  2007      F    TX      8
862166     4914201  4914202  Zyriah  2008      F    TX     10
867512     4919547  4919548  Zyriah  2009      F    TX      5
881208     4933243  4933244  Zyriah  2013      F    TX      7
...            ...      ...     ...   ...    ...   ...    ...
120728      691905   691906   Aadan  2008      M    CA      7
123846      695023   695024   Aadan  2009      M    CA      6
138678      709855   709856   Aadan  2014      M    CA      5
693699     3865866  3865867   Aaban  2013      M    NY      6
695768     3867935  3867936   Aaban  2014      M    NY      6

[1016395 rows x 7 columns]

In [17]:
 df['Age']=2021-df['Year']

In [18]:
df.head(5)

   Unnamed: 0     Id     Name  Year Gender State  Count  Age
0       11349  11350     Emma  2004      F    AK     62   17
1       11350  11351  Madison  2004      F    AK     48   17
2       11351  11352   Hannah  2004      F    AK     46   17
3       11352  11353    Grace  2004      F    AK     44   17
4       11353  11354    Emily  2004      F    AK     41   17

In [19]:
df=df.drop(columns=['Year'])

In [20]:
df['Score']=df.iloc[:,6:7].sum(axis=1)
df

         Unnamed: 0       Id     Name Gender State  Count  Age  Score
0             11349    11350     Emma      F    AK     62   17     17
1             11350    11351  Madison      F    AK     48   17     17
2             11351    11352   Hannah      F    AK     46   17     17
3             11352    11353    Grace      F    AK     44   17     17
4             11353    11354    Emily      F    AK     41   17     17
...             ...      ...      ...    ...   ...    ...  ...    ...
1016390     5647421  5647422     Seth      M    WY      5    7      7
1016391     5647422  5647423  Spencer      M    WY      5    7      7
1016392     5647423  5647424     Tyce      M    WY      5    7      7
1016393     5647424  5647425   Victor      M    WY      5    7      7
1016394     5647425  5647426   Waylon      M    WY      5    7      7

[1016395 rows x 8 columns]

In [21]:
li=list(df.columns)

In [22]:
li

['Unnamed: 0', 'Id', 'Name', 'Gender', 'State', 'Count', 'Age', 'Score']

In [23]:
#df=df.drop(columns='Score')
df.head(5)

   Unnamed: 0     Id     Name Gender State  Count  Age  Score
0       11349  11350     Emma      F    AK     62   17     17
1       11350  11351  Madison      F    AK     48   17     17
2       11351  11352   Hannah      F    AK     46   17     17
3       11352  11353    Grace      F    AK     44   17     17
4       11353  11354    Emily      F    AK     41   17     17

In [24]:
 #df=df[li[0:5]+[li[7]]+[li[6]]

In [25]:
df.loc[(df['Name']=='Emma') | ( df['State']=='AK')]

         Unnamed: 0       Id     Name Gender State  Count  Age  Score
0             11349    11350     Emma      F    AK     62   17     17
1             11350    11351  Madison      F    AK     48   17     17
2             11351    11352   Hannah      F    AK     46   17     17
3             11352    11353    Grace      F    AK     44   17     17
4             11353    11354    Emily      F    AK     41   17     17
...             ...      ...      ...    ...   ...    ...  ...    ...
1013854     5633487  5633488     Emma      F    WY     23   11     11
1013983     5633616  5633617     Emma      F    WY     43   10     10
1014104     5633737  5633738     Emma      F    WY     40    9      9
1014222     5633855  5633856     Emma      F    WY     30    8      8
1014362     5633995  5633996     Emma      F    WY     32    7      7

[5546 rows x 8 columns]

In [26]:
EmmaAK=df.loc[(df['Name']=='Emma') & ( df['State']=='AK')]

In [27]:
new_df=df.head(5)

In [28]:
new_df

   Unnamed: 0     Id     Name Gender State  Count  Age  Score
0       11349  11350     Emma      F    AK     62   17     17
1       11350  11351  Madison      F    AK     48   17     17
2       11351  11352   Hannah      F    AK     46   17     17
3       11352  11353    Grace      F    AK     44   17     17
4       11353  11354    Emily      F    AK     41   17     17

In [29]:
new_df.to_csv('new_df.csv')

In [30]:
EmmaAK

      Unnamed: 0     Id  Name Gender State  Count  Age  Score
0          11349  11350  Emma      F    AK     62   17     17
205        11554  11555  Emma      F    AK     49   16     16
418        11767  11768  Emma      F    AK     49   15     15
644        11993  11994  Emma      F    AK     41   14     14
838        12187  12188  Emma      F    AK     51   13     13
1068       12417  12418  Emma      F    AK     38   12     12
1276       12625  12626  Emma      F    AK     51   11     11
1498       12847  12848  Emma      F    AK     56   10     10
1732       13081  13082  Emma      F    AK     57    9      9
1948       13297  13298  Emma      F    AK     57    8      8
2173       13522  13523  Emma      F    AK     50    7      7

In [31]:
EmmaAK=EmmaAK.reset_index()

In [32]:
EmmaAK

    index  Unnamed: 0     Id  Name Gender State  Count  Age  Score
0       0       11349  11350  Emma      F    AK     62   17     17
1     205       11554  11555  Emma      F    AK     49   16     16
2     418       11767  11768  Emma      F    AK     49   15     15
3     644       11993  11994  Emma      F    AK     41   14     14
4     838       12187  12188  Emma      F    AK     51   13     13
5    1068       12417  12418  Emma      F    AK     38   12     12
6    1276       12625  12626  Emma      F    AK     51   11     11
7    1498       12847  12848  Emma      F    AK     56   10     10
8    1732       13081  13082  Emma      F    AK     57    9      9
9    1948       13297  13298  Emma      F    AK     57    8      8
10   2173       13522  13523  Emma      F    AK     50    7      7

In [35]:
emma=df.loc[~df['Name'].str.contains('mm')]
emma

         Unnamed: 0       Id     Name Gender State  Count  Age  Score
1             11350    11351  Madison      F    AK     48   17     17
2             11351    11352   Hannah      F    AK     46   17     17
3             11352    11353    Grace      F    AK     44   17     17
4             11353    11354    Emily      F    AK     41   17     17
5             11354    11355  Abigail      F    AK     37   17     17
...             ...      ...      ...    ...   ...    ...  ...    ...
1016390     5647421  5647422     Seth      M    WY      5    7      7
1016391     5647422  5647423  Spencer      M    WY      5    7      7
1016392     5647423  5647424     Tyce      M    WY      5    7      7
1016393     5647424  5647425   Victor      M    WY      5    7      7
1016394     5647425  5647426   Waylon      M    WY      5    7      7

[1009626 rows x 8 columns]

In [36]:
emma=df.loc[df['Name'].str.contains('mm')]
emma

         Unnamed: 0       Id      Name Gender State  Count  Age  Score
0             11349    11350      Emma      F    AK     62   17     17
163           11512    11513    Summer      F    AK      6   17     17
205           11554    11555      Emma      F    AK     49   16     16
342           11691    11692    Summer      F    AK      7   16     16
418           11767    11768      Emma      F    AK     49   15     15
...             ...      ...       ...    ...   ...    ...  ...    ...
1014222     5633855  5633856      Emma      F    WY     30    8      8
1014362     5633995  5633996      Emma      F    WY     32    7      7
1015515     5646546  5646547  Emmanuel      M    WY      5   12     12
1016198     5647229  5647230    Emmett      M    WY      5    8      8
1016296     5647327  5647328    Emmett      M    WY      9    7      7

[6769 rows x 8 columns]

In [41]:
emma.loc[emma['Name']=='Emma','Name']='new name'
emma

         Unnamed: 0       Id      Name Gender State  Count  Age  Score
0             11349    11350  new name      F    AK     62   17     17
163           11512    11513    Summer      F    AK      6   17     17
205           11554    11555  new name      F    AK     49   16     16
342           11691    11692    Summer      F    AK      7   16     16
418           11767    11768  new name      F    AK     49   15     15
...             ...      ...       ...    ...   ...    ...  ...    ...
1014222     5633855  5633856  new name      F    WY     30    8      8
1014362     5633995  5633996  new name      F    WY     32    7      7
1015515     5646546  5646547  Emmanuel      M    WY      5   12     12
1016198     5647229  5647230    Emmett      M    WY      5    8      8
1016296     5647327  5647328    Emmett      M    WY      9    7      7

[6769 rows x 8 columns]

In [42]:
emma.loc[emma['Name']=='new name','Name']='Emma'
emma

C:\Users\Tandale Datta\anaconda3\lib\site-packages\pandas\core\indexing.py:1765: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  isetter(loc, value)

         Unnamed: 0       Id      Name Gender State  Count  Age  Score
0             11349    11350      Emma      F    AK     62   17     17
163           11512    11513    Summer      F    AK      6   17     17
205           11554    11555      Emma      F    AK     49   16     16
342           11691    11692    Summer      F    AK      7   16     16
418           11767    11768      Emma      F    AK     49   15     15
...             ...      ...       ...    ...   ...    ...  ...    ...
1014222     5633855  5633856      Emma      F    WY     30    8      8
1014362     5633995  5633996      Emma      F    WY     32    7      7
1015515     5646546  5646547  Emmanuel      M    WY      5   12     12
1016198     5647229  5647230    Emmett      M    WY      5    8      8
1016296     5647327  5647328    Emmett      M    WY      9    7      7

[6769 rows x 8 columns]

In [43]:
df.head(5)

   Unnamed: 0     Id     Name Gender State  Count  Age  Score
0       11349  11350     Emma      F    AK     62   17     17
1       11350  11351  Madison      F    AK     48   17     17
2       11351  11352   Hannah      F    AK     46   17     17
3       11352  11353    Grace      F    AK     44   17     17
4       11353  11354    Emily      F    AK     41   17     17

In [45]:
df.groupby(['Name']).mean()

           Unnamed: 0            Id      Count        Age      Score
Name
Aaban    3.866900e+06  3.866902e+06   6.000000   7.500000   7.500000
Aadan    1.789515e+06  1.789516e+06   5.750000  11.250000  11.250000
Aadarsh  1.728030e+06  1.728031e+06   5.000000  12.000000  12.000000
Aaden    2.831898e+06  2.831899e+06  17.479592  10.984694  10.984694
Aadhav   7.096060e+05  7.096070e+05   6.000000   7.000000   7.000000
...               ...           ...        ...        ...        ...
Zyra     2.505571e+06  2.505572e+06   6.000000   8.857143   8.857143
Zyrah    2.743536e+06  2.743538e+06   5.500000   9.000000   9.000000
Zyren    5.074229e+06  5.074230e+06   6.000000   8.000000   8.000000
Zyria    2.978703e+06  2.978704e+06   5.900000  12.100000  12.100000
Zyriah   3.794022e+06  3.794023e+06   6.444444  11.333333  11.333333

[17632 rows x 5 columns]

In [53]:
df.groupby(['Name']).mean().sort_values('Age',ascending=False)

          Unnamed: 0         Id  Count   Age  Score
Name
Steffi      523744.0   523745.0    6.0  17.0   17.0
Elpidio     681022.0   681023.0    5.0  17.0   17.0
Caillou     680957.0   680958.0    5.0  17.0   17.0
Ellissa    1053071.0  1053072.0    5.0  17.0   17.0
Shakim     3847726.0  3847727.0    5.0  17.0   17.0
...              ...        ...    ...   ...    ...
Erabella    565101.0   565102.0    5.0   7.0    7.0
Sema       3749622.0  3749623.0    5.0   7.0    7.0
Emmarae    1076649.0  1076650.0    5.0   7.0    7.0
Emitt      4050539.0  4050540.0    5.0   7.0    7.0
Evalena     564640.0   564641.0    6.0   7.0    7.0

[17632 rows x 5 columns]

In [54]:
df['Age'].sum()

12142678

In [55]:
df.count()

Unnamed: 0    1016395
Id            1016395
Name          1016395
Gender        1016395
State         1016395
Count         1016395
Age           1016395
Score         1016395
dtype: int64

In [61]:
df['Count']=1
all=df.groupby(['Name']).count()['Count']

In [62]:
all

Name
Aaban        2
Aadan        4
Aadarsh      1
Aaden      196
Aadhav       1
          ...
Zyra         7
Zyrah        2
Zyren        1
Zyria       10
Zyriah       9
Name: Count, Length: 17632, dtype: int64

In [67]:
 #for chunk in pd.read_csv('US_Baby_Names_right.csv',chunksize=1000):
  #      print("DF for big data" )
   #     print(chunk)